//ZTPDOGOS EXEC PGM=ZTESTEXE
//STEPLIB  DD DISP=SHR,DSN=xxx.WORKSHOP.LOAD
//         DD DISP=SHR,DSN=xxx.WORKSHOP.CT4ZLOAD
//ADOPTS   DD DISP=SHR,DSN=xxx.WORKSHOP.INPUT(ADOPTS)
//OUTREP   DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//ZLMSG    DD SYSOUT=*
//ZLDATA   DD DISP=SHR,DSN=xxx.DOGOS.ZLDATA     
//ZLOPTS   DD *
  RUN(ZTPDOGOS)
/*
//CEEOPTS  DD *
  TRAP(ON,NOSPIE)
/*