      * THE DATA STRUCTURE OF THE RECORD IN THE DOGGOS REPORT
       01  ADOPTED-REPORT-REC.
           05 FILLER PIC X(6) VALUE "BREED ".
           05 DOG-BREED PIC X(30).
           05 FILLER PIC X(13) VALUE " WAS ADOPTED ".
           05 ADOPTED-AMOUNT PIC 9(3).
           05 FILLER PIC X(6) VALUE " TIMES".
           05 FILLER PIC X(22) VALUE SPACES.